update architecture doc to use mermaid syntax
